#include <iostream>
using namespace std;

int main()
{
    // вибір арифметичної операції
    int TypeOfOperation;
    cout << "Виберіть дію(1-додавання, 2-віднімання, 3-множення): ";
    cin >> TypeOfOperation;

    // створюємо світч
    switch (TypeOfOperation)
    {
        // ДОДАВАННЯ
    case 1:
        // ІНІАЛІЗУЄМО ЗМІННІ
        int m, n, a[100][100], b[100][100], c[100][100];

        cout << "Введіть кількість рядків у матриці A: ";
        cin >> m;
        cout << "Введіть кількість стовпців у матриці A: ";
        cin >> n;

        // УТВОРЮЄМО МАТРИЦЮ А
        cout << "Введіть елементи матриці A: " << endl;
        for (int i = 0; i < m; i++)
        {
            for (int j = 0; j < n; j++)
            {
                cout << "A[" << i << "][" << j << "] = ";
                cin >> a[i][j];
            }
        }

        // УТВОРЮЄМО МАТРИЦЮ В
        cout << "Введіть елементи матриці B: " << endl;
        for (int i = 0; i < m; i++)
        {
            for (int j = 0; j < n; j++)
            {
                cout << "B[" << i << "][" << j << "] = ";
                cin >> b[i][j];
            }
        }

        // УТВОРЮЄМО РЕЗУЛЬТАТ
        for (int i = 0; i < m; i++)
        {
            for (int j = 0; j < n; j++)
            {
                c[i][j] = a[i][j] + b[i][j];
            }
        }

        // ВИВОДИМО РЕЗУЛЬТАТ
        cout << "Результат додавання: " << endl;
        for (int i = 0; i < m; i++)
        {
            for (int j = 0; j < n; j++)
            {
                cout << c[i][j] << " ";
            }
            cout << endl;
        }

        return 0;
        break;

        // ВІДНІМАННЯ
    case 2:
        // ІНІАЛІЗУЄМО ЗМІННІ
        int m2, n2, a2[100][100], b2[100][100], c2[100][100];

        cout << "Введіть кількість рядків у матриці A: ";
        cin >> m2;
        cout << "Введіть кількість стовпців у матриці A: ";
        cin >> n2;

        // УТВОРЮЄМО МАТРИЦЮ А
        cout << "Введіть елементи матриці A: " << endl;
        for (int i = 0; i < m2; i++)
        {
            for (int j = 0; j < n2; j++)
            {
                cout << "A[" << i << "][" << j << "] = ";
                cin >> a2[i][j];
            }
        }

        // УТВОРЮЄМО МАТРИЦЮ В
        cout << "Введіть елементи матриці B: " << endl;
        for (int i = 0; i < m2; i++)
        {
            for (int j = 0; j < n2; j++)
            {
                cout << "B[" << i << "][" << j << "] = ";
                cin >> b2[i][j];
            }
        }

        // УТВОРЮЄМО РЕЗУЛЬТАТ
        for (int i = 0; i < m2; i++)
        {
            for (int j = 0; j < n2; j++)
            {
                c2[i][j] = a2[i][j] - b2[i][j];
            }
        }

        // ВИВОДИМО РЕЗУЛЬТАТ
        cout << "Результат віднімання: " << endl;
        for (int i = 0; i < m2; i++)
        {
            for (int j = 0; j < n2; j++)
            {
                cout << c2[i][j] << " ";
            }
            cout << endl;
        }

        return 0;
        break;

        // МНОЖЕННЯ
    case 3:
        // ІНІАЛІЗУЄМО ЗМІННІ
        int ma, na, mb, nb, a3[100][100], b3[100][100], c3[100][100];
        cout << "Введіть кількість рядків матриці А: ";
        cin >> ma;
        cout << "Введіть кількість стовпців матриці А: ";
        cin >> na;
        cout << "Введіть кількість рядків матриці В: ";
        cin >> mb;
        cout << "Введіть кількість стовпців матриці В: ";
        cin >> nb;

        // ПЕРЕВІРЯЄМО ЧИ МОЖНА ПЕРЕМНОЖИТИ МАТРИЦІ
        if (na == mb)
        {
            // УТВОРЮЄМО МАТРИЦЮ А

            cout << "Введіть елементи матриці A: " << endl;
            for (int i = 0; i < ma; i++)
            {
                for (int j = 0; j < na; j++)
                {
                    cout << "A[" << i << "][" << j << "] = ";
                    cin >> a3[i][j];
                }
            };

            // УТВОРЮЄМО МАТРИЦЮ В

            cout << "Введіть елементи матриці B: " << endl;
            for (int i = 0; i < mb; i++)
            {
                for (int j = 0; j < nb; j++)
                {
                    cout << "B[" << i << "][" << j << "] = ";
                    cin >> b3[i][j];
                }
            }

            // ІНІЦІАЛІЗУЄМО МАТРИЦЮ С(А*В)
            int c[ma][nb];

            // ПЕРЕМНОЖАЄМО МАТРИЦІ
            for (int i = 0; i < ma; i++)
            {
                for (int j = 0; j < nb; j++)
                {
                    for (int k = 0; k < na; k++)
                    {
                        c3[i][j] += a3[i][k] * b3[k][j];
                    }
                }
            }

            // ВИВОДИМО РЕЗУЛЬТАТ МНОЖЕННЯ
            for (int i = 0; i < ma; i++)
            {
                for (int j = 0; j < nb; j++)
                {
                    cout << c3[i][j] << " ";
                }
                cout << endl;
            }

            return 0;
        }
    }
}